export default function Education() {
  return (
    <section className="col2">
      <h3>Education</h3>
      <p>
        <p>
          Мой путь в мир веб-разработки начался с изучения книги "Head First
          HTML5 Programming: Building Web Apps with JavaScript". Это был первый
          шаг в погружении в мир веб-технологий, который только укрепил моё
          желание развиваться в этой области.
        </p>
        <p>
          Я закончила курсы в престижной школе The Rolling Scopes School, где
          посвятила более года изучению фронтенд-разработки. Этот опыт был для
          меня не только уникальным обучающим процессом, но и возможностью
          погрузиться в профессиональную среду и получить ценный опыт работы в
          команде.
        </p>
        <h3>Подробнее о разработке в RSSchoole</h3>
        <p>
          В течение обучения я дважды принимала участие в командных проектах. В
          первом проекте мы разрабатывали интернет-магазин с использованием
          ванильного JavaScript, что позволило мне освоить основы разработки
          веб-приложений и работу в команде. Второй коммандный проект был связан
          с созданием приложения для запросов через GraphQL, где я углубила свои
          знания и навыки в React.
          
           Кроме того, у меня есть опыт разработки
          индивидуальных проектов, где я могла проявить свою креативность и
          самостоятельность в реализации идей. Я также успешно завершила курс
          RSSchol по Node.js.
          
          
          
           В течение этого курса я приобрела ценный опыт,
          работая над различными проектами и глубоко погружаясь в мир серверной
          разработки. В частности, я создавала небольшой файловый менеджер,
          который помог мне улучшить понимание работы с файловой системой и
          асинхронными операциями. Также я разрабатывала игру "Морской бой",
          используя технологию веб-сокетов, что позволило мне погрузиться в
          аспекты реального времени и взаимодействия между клиентом и сервером.
          Одним из проектов было создание CRUD API без использования
          фреймворков, что дало мне глубокое понимание основ работы с
          HTTP-запросами, маршрутизацией и обработкой данных на стороне сервера.
          Кроме того, я также работала над API с использованием Nest.js с
          подключением к базе данных PostgreSQL с помощью TypeORM и Docker, что
          позволило мне узнать о преимуществах работы с реляционными базами
          данных и контейнеризации приложений. Этот опыт в области серверной
          разработки дополнил мои знания в сфере веб-технологий и подготовил
          меня к более широкому кругу задач и проектов. Я готова применить свои
          навыки и опыт на практике, участвуя в разработке инновационных
          веб-приложений и продвигая свою карьеру в сфере разработки
          программного обеспечения. В свободное время я также учусь играть на
          гитаре и наслаждаюсь природой, особенно проводя время на даче. Всегда
          готова к новым вызовам и постоянному развитию как в области frontend
          разработки, так и в личной жизни.
        </p>
      </p>
    </section>
  );
}
