export default function About() {
  return (
    <section id="about" className="col2">
      <h3>Обо мне</h3>
      <div>
        <p>
          Амбициозный начитающий frontend разработчик, в прошлом - юрист,
          страдающий от бумажной работы и бюрократических
          процедур. Мое истинное призвание всегда заключалось в создании чего-то
          нового и вдохновляющего. Этот аспект программирования привлёк меня
          сильнее всего - возможность воплотить свои идеи в работающее
          приложение и видеть результат своего труда.
        </p>
        <p>
          Обучалась в The Rolling Scopes School, где
          посвятила более года изучению фронтенд-разработки, а также немного
          погрузилась в серверную разработку на NodeJS. Этот опыт был для меня
          не только уникальным обучающим процессом, но и возможностью
          погрузиться в профессиональную среду и командную работу.
        </p>
        <p>
          Всегда открыта к новым вызовам и знаниям. В будущем вижу себя
          full-stuck разработчиком.
        </p>
      </div>
    </section>
  );
}
